cases/TOPFLOW/constant/momentumTransfer.FPT
FoamFile
{
    format      ascii;
    class       dictionary;
    object
;
}

drag
{
    #include "FPT/drags"
}

virtualMass
{
    #include "FPT/virtualMasses"
}

heatTransfer
{}

phaseTransfer
{}

lift
{
    #include "FPT/lifts"
}

wallLubrication
{
    #include "FPT/wallLubrications"
}

turbulentDispersion
{
    #include "FPT/turbulentDispersions"
}
