cases/TOPFLOW/constant/momentumTransfer.LogMoM
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransfers;
}

drag
{
    air_dispersedIn_water
    {
        type            LogMoM;
        mode            quadrature;
        GaussHermite    3;

        drag
        {
            type        IshiiZuber;
            residualRe  1e-3;
        }
    }

    water_dispersedIn_air
    {
        type        SchillerNaumann;
        residualRe  1e-3;
    }

    air_segregatedWith_water
    {
        type    segregated;
        m       0.5;
        n       8;
    }
}

virtualMass
{
    air_dispersedIn_water
    {
        type    constantCoefficient;
        Cvm     0.5;
    }

    water_dispersedIn_air
    {
        type    constantCoefficient;
        Cvm     0.5;
    }
}

heatTransfer
{}

phaseTransfer
{}

lift
{
    air_dispersedIn_water
    {
        type            LogMoM;
        mode            quadrature;
        GaussHermite    3;

        lift
        {
            type    Tomiyama;

            aspectRatio
            {
                type    Wellek;
            }
        }

        wallDamping
        {
            type                linear;
            Cd                  1;
            zeroInNearWallCells true;
        }
    }

    water_dispersedIn_air
    {
        type    none;
    }
}

wallLubrication
{
    air_dispersedIn_water
    {
        type            LogMoM;
        mode            quadrature;
        GaussHermite    3;

        wallLubrication
        {
            type    Frank;
            Cwc	    10;
            Cwd     6.8;
            p       1.7;
        }
    }

    water_dispersedIn_air
    {
        type    none;
    }
}

turbulentDispersion
{
    air_dispersedIn_water
    {
        type            LogMoM;
        mode            quadrature;
        GaussHermite    3;

        turbulentDispersion
        {
            type    Burns;
            sigma   1;
        }
    }

    water_dispersedIn_air
    {
        type    none;
    }
}
