cases/TOPFLOW/constant/phaseProperties.FPT
FoamFile
{
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}

phases
(
    #include "FPT/phaseNames"
);

populationBalances (air);

#include "FPT/phases"

water
{
    type            pureIsothermalPhaseModel;

    diameterModel   none;

    residualAlpha   1e-12;
}

populationBalanceCoeffs
{
    air
    {
        continuousPhase water;

        coalescenceModels
        ();

        binaryBreakupModels
        ();

        breakupModels
        ();

        driftModels
        (
            densityChange{}
        );

        nucleationModels
        ();
    }
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{
    #include "FPT/surfaceTensions"
}

interfaceCompression
{}
