cases/TOPFLOW/constant/phaseProperties.LogMoM
FoamFile
{
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}

phases (air water);

air
{
    type            pureIsothermalPhaseModel;

    diameterModel   LogMoM;

    LogMoMCoeffs
    {
        dMax            1e-1;
        dMin            1e-4;

        continuousPhase water;

        phaseChange     false;

        sources
        (
            coalescence
            {
                type            PrinceBlanch;
                GaussHermite    3;
                turbulence      true;
                buoyancy        true;
                laminarShear    false;
            }

            breakup
            {
                type            LuoSvendsen;
                GaussHermite    3;
                GaussLegendre   5;
            }
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;

    diameterModel   constant;

    constantCoeffs
    {
        d           1e-4;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.3;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.3;
    }

    drag
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.5;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.5;
    }
}

surfaceTension
{
    air_water
    {
        type    constant;
        sigma   0.07197;
    }
}

interfaceCompression
{}

aspectRatio
{
    air_dispersedIn_water
    {
        type Wellek;
    }
}
