cases/TOPFLOW/constant/templates/drag.m4
VARPHASEPAIR
{
    type        SchillerNaumann;
    residualRe  1e-3;
}
