cases/TOPFLOW/constant/templates/surfaceTension.m4
VARPHASEPAIR2
{
    type    constant;
    sigma   0.07197;
}
