cases/TOPFLOW/constant/templates/turbulentDispersion.m4
VARPHASEPAIR
{
    type    Burns;
    sigma   1;
}
