cases/TOPFLOW/constant/templates/wallLubrication.m4
VARPHASEPAIR
{
    type    Frank;
    Cwc	    10;
    Cwd     6.8;
    p       1.7;
}
