cases/TOPFLOW/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 8;

method simple;

simpleCoeffs
{
    n               (1 8 1);
    delta           0.001;
}
