cases/TOPFLOW/system/templates/functionF.m4
VARFUNCTIONNAME
{
    type            surfaceFieldValue;
    patch           VARPATCHNAME;
    fields          (VARFFIELD);
    operation       sum;
    weightField     VARALPHAFLUX;
    writeControl    writeTime;
    writeFields     false;
}
