cases/TOPFLOW/system/templates/functionPhi.m4
VARFUNCTIONNAME
{
    type            surfaceFieldValue;
    patch           VARPATCHNAME;
    fields          (VARFLUX);
    operation       sum;
    writeControl    writeTime;
    writeFields     false;
}
